[
    {
        "name": "12 Pool Rush",
        "type": "strategy",
        "description": "An aggressive early game Zerg strategy using fast Zerglings from a 12 supply Spawning Pool to catch the opponent off guard."
    },
    {
        "name": "2-1-1 Stim Timing",
        "type": "timing",
        "description": "A Terran push with two Medivacs and Stimpack around 5:30 to pressure a Zerg before they can safely drone."
    },
    {
        "name": "4 Base Macro Focus",
        "type": "macro",
        "description": "Focusing on production, expansions, and economy while minimizing unnecessary engagements."
    },
    {
        "name": "All-In Timing",
        "type": "other",
        "description": "A push where the player commits all resources to one timing attack, often without a fallback economy."
    },
    {
        "name": "Baneling Bust",
        "type": "tactic",
        "description": "Using Banelings to break through a wall-off or fortified entrance, typically to allow Zerglings to flood in early. Common against Terran or Protoss to punish greedy builds or lack of wall defenses."
    },
    {
        "name": "Baneling Drops",
        "type": "harassment",
        "description": "Dropping Banelings into mineral lines to catch workers off guard and deal significant damage."
    },
    {
        "name": "Burrowed Roach Ambush",
        "type": "psychological",
        "description": "Using hidden units to surprise your opponent, creating panic and overreaction."
    },
    {
        "name": "Cannon Rush Meta",
        "type": "meta",
        "description": "A commonly used strategy on ladder where players attempt to win early using proxy Photon Cannons."
    },
    {
        "name": "Creep Spread",
        "type": "map control",
        "description": "Spreading Creep Tumors to gain vision, speed up unit movement, and control the map."
    },
    {
        "name": "Disruptor Shots",
        "type": "unit control",
        "description": "Using Disruptors effectively to zone out enemy units and deal massive area damage."
    },
    {
        "name": "Faking Pressure",
        "type": "psychological",
        "description": "Pretending to commit to an attack to force a reaction or scout information."
    },
    {
        "name": "Fast Expand",
        "type": "economic",
        "description": "Expanding quickly to a second base in order to boost economy and tech faster."
    },
    {
        "name": "High Ground Advantage",
        "type": "positioning",
        "description": "Taking fights from the high ground to gain vision and defensive advantages."
    },
    {
        "name": "Hydra to Lurker Transition",
        "type": "transition",
        "description": "Teching from Hydralisks into Lurkers for late-game defense and positional strength."
    },
    {
        "name": "Inject Management",
        "type": "resource management",
        "description": "Maintaining regular Queen injects to ensure larva production and stable economy."
    },
    {
        "name": "Ling Flood",
        "type": "tactic",
        "description": "Mass producing Zerglings to overwhelm the opponent before they can stabilize."
    },
    {
        "name": "Ling-Bane into Muta",
        "type": "adaptation",
        "description": "Adjusting into Mutalisks after seeing the opponent overcommit to ground anti-light units."
    },
    {
        "name": "Marine Split",
        "type": "micro",
        "description": "Manually spreading Marines during fights to reduce splash damage from Banelings or Psionic Storm."
    },
    {
        "name": "Overlord Sacrifice",
        "type": "scouting",
        "description": "Sending an Overlord into the enemy base to scout tech paths at the cost of losing it."
    },
    {
        "name": "Prism Micro",
        "type": "unit control",
        "description": "Using Warp Prisms to pick up and drop units mid-fight to extend their lifespan and efficiency."
    },
    {
        "name": "Proxy Hatchery",
        "type": "strategy",
        "description": "Building a Hatchery in the opponent's base or near their expansion to produce units and apply pressure."
    },
    {
        "name": "Roach Ravager Composition",
        "type": "composition",
        "description": "A mid-game Zerg composition utilizing Roaches and Ravagers for strong pushes and zone control."
    },
    {
        "name": "Roach Ravager Push",
        "type": "offensive",
        "description": "A mid-game push using Roaches and Ravagers to apply pressure and potentially end the game."
    },
    {
        "name": "Standard ZvT Build Order",
        "type": "build order",
        "description": "A safe and economic Zerg build for defending early pressure and transitioning into a mid-game army."
    },
    {
        "name": "Stim Push",
        "type": "offensive",
        "description": "Using Stimmed bio units to put pressure on the opponent before their army is complete."
    },
    {
        "name": "Wall-Off at the Ramp",
        "type": "defensive",
        "description": "Using buildings to block choke points and defend against early rushes."
    },
    {
        "name": "Watchtower Control",
        "type": "map control",
        "description": "Maintaining vision over key areas of the map using Xel'Naga Watchtowers."
    },
    {
        "name": "Widow Mine Drop",
        "type": "harassment",
        "description": "Dropping Widow Mines in mineral lines to force reactions and deny mining."
    },
    {
        "name": "Zergling Run-By",
        "type": "tactic",
        "description": "Using Zerglings to attack enemy mineral lines or bases while the main armies are engaged elsewhere."
    }
]
